ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/scb/cy_scb_spi.c
/***************************************************************************//**
* \file cy_scb_spi.c
* \version 1.0
*
* Provides SPI API implementation of the SCB driver.
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_scb_spi.h"

#if defined(__cplusplus)
extern "C" {
#endif

/* Static functions */
static void HandleTransmit(CySCB_Type *base, cy_stc_scb_spi_context_t *context);
static void HandleReceive (CySCB_Type *base, cy_stc_scb_spi_context_t *context);
static void DiscardArrayNoCheck(CySCB_Type const *base, uint32_t size);

/*******************************************************************************
* Function Name: Cy_SCB_SPI_Init
****************************************************************************//**
*
* Initializes the SCB for SPI operation.
*
* \param base
* The pointer to the SPI SCB instance.
*
* \param config
* The pointer to the configuration structure \ref cy_stc_scb_spi_config_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_scb_spi_context_t allocated
* by the user. The structure is used during the SPI operation for internal
* configuration and data keeping. The user should not modify anything
* in this structure.
* If only SPI functions which do not require context will be used pass NULL
* as pointer to context.
*
* \return
* \ref cy_en_scb_spi_status_t
*
* \note
* Ensure that the SCB block is disabled before calling this function.
*
*******************************************************************************/
cy_en_scb_spi_status_t Cy_SCB_SPI_Init(CySCB_Type *base, cy_stc_scb_spi_config_t const *config, cy_stc_scb_spi_context_t *context)
{
    cy_en_scb_spi_status_t retStatus = CY_SCB_SPI_BAD_PARAM;

    if ((NULL != base) && (NULL != config))
    {
        /* Set SCLK mode for TI - CY_SCB_SPI_CPHA1_CPOL0, NS - CY_SCB_SPI_CPHA0_CPOL0, Motorola - take from config */
        uint32_t locSclkMode = (CY_SCB_SPI_MOTOROLA == config->subMode) ? config->sclkMode :
                                ((CY_SCB_SPI_NATIONAL == config->subMode) ? CY_SCB_SPI_CPHA0_CPOL0 : CY_SCB_SPI_CPHA1_CPOL0);

        /* Configure an SPI interface */
        base->CTRL = (((config->rxDataWidth <= CY_SCB_BYTE_WIDTH) && (config->txDataWidth <= CY_SCB_BYTE_WIDTH)) ?
                          SCB_CTRL_BYTE_MODE_Msk : 0UL)                                |
                         (config->enableWakeFromSleep ? SCB_CTRL_EC_AM_MODE_Msk : 0UL) |
                          _VAL2FLD(SCB_CTRL_OVS, (config->oversample - 1UL))           |
                          _VAL2FLD(SCB_CTRL_MODE, CY_SCB_CTRL_MODE_SPI);

        base->SPI_CTRL = (config->enableTransferSeperation       ? 0UL : SCB_SPI_CTRL_SSEL_CONTINUOUS_Msk)         |
                            ((0UL != (CY_SCB_SPI_TI_PRECEDE & config->subMode)) ? SCB_SPI_CTRL_SELECT_PRECEDE_Msk : 0UL) |
                            (config->enableMisoLateSample           ? SCB_SPI_CTRL_LATE_MISO_SAMPLE_Msk : 0UL)        |
                            (config->enableFreeRunSclk              ? SCB_SPI_CTRL_SCLK_CONTINUOUS_Msk : 0UL)         |
                            ((CY_SCB_SPI_MASTER == config->spiMode)    ? SCB_SPI_CTRL_MASTER_MODE_Msk : 0UL)             |
                            _VAL2FLD(CY_SCB_SPI_CTRL_CLK_MODE, locSclkMode)                                              |
                            _VAL2FLD(CY_SCB_SPI_CTRL_SSEL_POLARITY, config->ssPolarity)                                  |
                            _VAL2FLD(SCB_SPI_CTRL_MODE, config->subMode);

        /* Configure the RX direction */
        base->RX_CTRL = (config->enableMsbFirst    ? SCB_RX_CTRL_MSB_FIRST_Msk : 0UL) |
                           (config->enableInputFilter ? SCB_RX_CTRL_MEDIAN_Msk : 0UL)    |
                            _VAL2FLD(SCB_RX_CTRL_DATA_WIDTH, (config->rxDataWidth - 1UL));

        base->RX_FIFO_CTRL = _VAL2FLD(SCB_RX_FIFO_CTRL_TRIGGER_LEVEL, config->rxFifoTriggerLevel);

        /* Configure the TX direction */
        base->TX_CTRL = (config->enableMsbFirst ? SCB_RX_CTRL_MSB_FIRST_Msk : 0UL) |
                            _VAL2FLD(SCB_TX_CTRL_DATA_WIDTH, (config->txDataWidth - 1UL));

        base->TX_FIFO_CTRL = _VAL2FLD(SCB_TX_FIFO_CTRL_TRIGGER_LEVEL, config->txFifoTriggerLevel);

        /* Set up interrupt sources */
        base->INTR_TX_MASK = config->txFifoIntEnableMask;
        base->INTR_RX_MASK = config->rxFifoIntEnableMask;
        base->INTR_M       = (config->masterSlaveIntEnableMask & SCB_INTR_M_MASK_SPI_DONE_Msk);
        base->INTR_S       = (config->masterSlaveIntEnableMask & SCB_INTR_S_MASK_SPI_BUS_ERROR_Msk);
        base->INTR_SPI_EC_MASK = 0UL;

        /* Initialize the context */
        if (NULL != context)
        {
            context->status    = 0UL;

            context->txBufIdx  = 0UL;
            context->rxBufIdx  = 0UL;

            context->cbEvents = NULL;

        #if !defined(NDEBUG)
            /* Put an initialization key into the initKey variable to verify
            * context initialization in the transfer API.
            */
            context->initKey = CY_SCB_SPI_INIT_KEY;
        #endif /* !(NDEBUG) */
        }

        retStatus = CY_SCB_SPI_SUCCESS;
    }

    return (retStatus);
}


/*******************************************************************************
* Function Name: Cy_SCB_SPI_DeInit
****************************************************************************//**
*
* De-initializes the SCB block, returns the register values to default.
*
* \param base
* The pointer to the SPI SCB instance.
*
* \note
* Ensure that the SCB block is disabled before calling this function.
*
*******************************************************************************/
void Cy_SCB_SPI_DeInit(CySCB_Type *base)
{
    /* SPI interface */
    base->CTRL         = CY_SCB_CTRL_DEF_VAL;
    base->SPI_CTRL     = CY_SCB_SPI_CTRL_DEF_VAL;

    /* RX direction */
    base->RX_CTRL      = CY_SCB_RX_CTRL_DEF_VAL;
    base->RX_FIFO_CTRL = 0UL;

    /* TX direction */
    base->TX_CTRL      = CY_SCB_TX_CTRL_DEF_VAL;
    base->TX_FIFO_CTRL = 0UL;

